## Scipy Stats and an ANOVA hypothesis test

According to Scipy documentation it provides *fundamental algorithms for scientific computing in Python.*
Scipy stands for scientific python and this tool, although based on Pandas, it provides more optomised algorithms.
Scipy is open source and is maintained on Github. It is a scientific computing language in the Python language.

Scipy.stats contains a large number of statistical functions.

In [2]:
import pandas as pd
import numpy as np
import seaborn as sn

import matplotlib.pyplot as plt
from scipy import stats
from statsmodels.formula.api import ols
from statsmodels.formula.api import rlm
import statsmodels.api as sm

from statsmodels.sandbox.regression.predstd import (
    wls_prediction_std,
)

In [14]:
homeless_mar21 = pd.read_csv('/Users/mahon/Downloads/Homeless_mar21.csv')

In [ ]:
# ban on evictions and rent hikes ends April 2021. Ukraine war would not have a significant effect on housing in Ireland in Mar 2022.

In [4]:
homeless_mar21.head()

,Region,Total Adults,Male Adults,Female Adults,Adults Aged 18-24,Adults Aged 25-44,Adults Aged 45-64,Adults Aged 65+,Number of people who accessed Private Emergency Accommodation,Number of people who accessed Supported Temporary Accommodation,Number of people who accessed Temporary Emergency Accommodation,Number of people who accessed Other Accommodation,Number of Families,Number of Adults in Families,Number of Single-Parent families,Number of Dependants in Families
0,Dublin,"4,093","2,706","1,387",459,"2,392","1,179",63,"2,267","1,836",33,0,681,"1,020",342,"1,669"
1,Mid-East,338,231,107,51,188,91,8,206,129,3,0,55,76,34,121
2,Midlands,67,40,27,19,35,12,1,41,11,15,0,13,14,12,24
3,Mid-West,284,197,87,34,174,71,5,59,190,35,0,27,32,22,38
4,North-East,85,65,20,14,40,22,9,21,46,18,0,6,9,3,13

In [17]:
print(homeless_mar21.describe())

       Adults Aged 18-24  Adults Aged 65+  \
count           9.000000         9.000000
mean           82.000000        13.222222
std           142.723509        19.110061
min            13.000000         1.000000
25%            19.000000         5.000000
50%            34.000000         8.000000
75%            51.000000        11.000000
max           459.000000        63.000000

       Number of people who accessed Temporary Emergency Accommodation  \
count                                           9.000000
mean                                           12.888889
std                                            13.788079
min                                             0.000000
25%                                             0.000000
50%                                            12.000000
75%                                            18.000000
max                                            35.000000

       Number of people who accessed Other Accommodation  Number of Families  \
count                                           9.000000            9.000000
mean                                            0.111111          101.444444
std                                             0.333333          218.447426
min                                             0.000000            4.000000
25%                                             0.000000           13.000000
50%                                             0.000000           27.000000
75%                                             0.000000           55.000000
max                                             1.000000          681.000000

       Number of Single-Parent families
count                          9.000000
mean                          54.666667
std                          108.504608
min                            3.000000
25%                            9.000000
50%                           22.000000
75%                           34.000000
max                          342.000000

In [15]:
homeless_mar21 = homeless_mar21.drop(columns="Number of people who accessed Private Emergency Accommodation")

In [16]:
homeless_mar21 = homeless_mar21.drop(columns="Number of people who accessed Supported Temporary Accommodation")

In [20]:
homeless_mar21 = homeless_mar21.drop(columns="Number of people who accessed Temporary Emergency Accommodation")

In [18]:
homeless_mar21 = homeless_mar21.drop(columns="Number of people who accessed Other Accommodation")

In [21]:
homeless_mar21.head()

,Region,Total Adults,Male Adults,Female Adults,Adults Aged 18-24,Adults Aged 25-44,Adults Aged 45-64,Adults Aged 65+,Number of Families,Number of Adults in Families,Number of Single-Parent families,Number of Dependants in Families
0,Dublin,"4,093","2,706","1,387",459,"2,392","1,179",63,681,"1,020",342,"1,669"
1,Mid-East,338,231,107,51,188,91,8,55,76,34,121
2,Midlands,67,40,27,19,35,12,1,13,14,12,24
3,Mid-West,284,197,87,34,174,71,5,27,32,22,38
4,North-East,85,65,20,14,40,22,9,6,9,3,13

In [22]:
print(homeless_mar21.describe())

       Adults Aged 18-24  Adults Aged 65+  Number of Families  \
count           9.000000         9.000000            9.000000
mean           82.000000        13.222222          101.444444
std           142.723509        19.110061          218.447426
min            13.000000         1.000000            4.000000
25%            19.000000         5.000000           13.000000
50%            34.000000         8.000000           27.000000
75%            51.000000        11.000000           55.000000
max           459.000000        63.000000          681.000000

       Number of Single-Parent families
count                          9.000000
mean                          54.666667
std                          108.504608
min                            3.000000
25%                            9.000000
50%                           22.000000
75%                           34.000000
max                          342.000000

In [ ]:
homeless_mar22 = pd.read_csv('/Users/mahon/Downloads/Homeless_mar22.csv')

In [ ]:
homeless_mar22.head()

In [ ]:
print(homeless_mar22.describe())